          Dcl-Pr DayNumName Char(9);
            DayIn Packed(1);
          END-PR;

          Dcl-Pr MonthNumName Char(9);
            DayIn Packed(2);
          END-PR;        