000100210922         DCL-F  AutoInsDsp Workstn;
000101210922
000102210922         EXSR CLEAR;
000103210922         EXFMT AutoInfo;
000104210922         DOW NOT(*IN03);
000105210922
000106210922           If ReplaceVal = 0;
000107210922             *IN97 = *ON;
000108210922             EXFMT AutoInfo;
000109210922             *IN97 = *OFF;
000110210925             ITER;
000126210922           ELSE;
000127210922             EXSR DetermineCost;
000128210922           ENDIF;
000129210925
000130210925         *IN75 = *ON;
000131210925         Write AutoInfo;
000132210922         EXFMT AutoQuote;
000133210925         *IN75 = *OFF;
000134210925
000135210924         IF *IN03 = *OFF;
000136210922           EXSR CLEAR;
000137210922           EXFMT AutoInfo;
000138210925
000139210922         ENDIF;
000140210922         ENDDO;
000141210924         *INLR = *ON;
000142210922         RETURN;
000143210922
000144210922         BEGSR CLEAR;
000145210922           REPLACEVAL = 0;
000147210922         ENDSR;
000148210922
000149210922       BEGSR DetermineCost;
000150210922         AGE = 99;
000151210922         COST = 99;
000152210922       ENDSR;
